In [1]:
import numpy as np
import pandas as pd

In [9]:
np.random.rand?

In [6]:
user_data = {
    "MarksA": np.random.randint(30,100,5),
    "MarksB": np.random.randint(50,100,5),
    "MarksC": np.random.randint(30,100,5)
}

In [7]:
df = pd.DataFrame(user_data)
print(df)

   MarksA  MarksB  MarksC
0      30      62      53
1      91      72      67
2      93      66      91
3      76      97      42
4      82      91      31

In [10]:
df.head(3)

   MarksA  MarksB  MarksC
0      30      62      53
1      91      72      67
2      93      66      91

In [11]:
print(df.columns)

Index(['MarksA', 'MarksB', 'MarksC'], dtype='object')

In [12]:
df.to_csv('marks.csv')

In [19]:
my_data = pd.read_csv('marks.csv')
my_data = my_data.drop(columns=['Unnamed: 0'])

In [20]:
print(my_data)

   MarksA  MarksB  MarksC
0      30      62      53
1      91      72      67
2      93      66      91
3      76      97      42
4      82      91      31

In [21]:
df.describe()

          MarksA     MarksB     MarksC
count   5.000000   5.000000   5.000000
mean   74.400000  77.600000  56.800000
std    25.754611  15.533834  23.306651
min    30.000000  62.000000  31.000000
25%    76.000000  66.000000  42.000000
50%    82.000000  72.000000  53.000000
75%    91.000000  91.000000  67.000000
max    93.000000  97.000000  91.000000

In [22]:
df.tail()

   MarksA  MarksB  MarksC
0      30      62      53
1      91      72      67
2      93      66      91
3      76      97      42
4      82      91      31

In [23]:
# Row
df.iloc[3]

MarksA    76
MarksB    97
MarksC    42
Name: 3, dtype: int32

In [24]:
# Row and Column
df.iloc[3][1]

97

In [25]:
idx = df.columns.get_loc('MarksA')
print(idx)

0

In [26]:
df.iloc[:3,[1,2]]

   MarksB  MarksC
0      62      53
1      72      67
2      66      91

In [28]:
my_data = df.sort_values(by=['MarksA'],ascending= True)

In [29]:
my_data

   MarksA  MarksB  MarksC
0      30      62      53
3      76      97      42
4      82      91      31
1      91      72      67
2      93      66      91

In [30]:
data_array= df.values

In [31]:
print(data_array)

[[30 62 53]
 [91 72 67]
 [93 66 91]
 [76 97 42]
 [82 91 31]]

In [32]:
print(type(data_array))

<class 'numpy.ndarray'>

In [33]:
df1 = pd.DataFrame(data_array,columns=['Physics','Chemistry','Math'],dtype='int32')

In [34]:
df1

   Physics  Chemistry  Math
0       30         62    53
1       91         72    67
2       93         66    91
3       76         97    42
4       82         91    31

In [35]:
df1.to_csv('Marksheet.csv')

In [38]:
df2 = pd.read_csv('Marksheet.csv')
df2 = df2.drop(columns='Unnamed: 0')

In [39]:
df2

   Physics  Chemistry  Math
0       30         62    53
1       91         72    67
2       93         66    91
3       76         97    42
4       82         91    31